espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/hardware/driver/si7210/src/sl_si7210.c
/***************************************************************************//**
 * @file
 * @brief Driver for the Silicon Labs Si7210 Hall Effect Sensor
 *******************************************************************************
 * # License
 * <b>Copyright 2020 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#include <stddef.h>

#include "sl_i2cspm.h"
#include "sl_udelay.h"
#include "sl_si7210.h"
#include "sl_si7210_regs.h"
#include "sl_sleeptimer.h"

// Local prototypes
static sl_status_t sl_si7210_load_coefficients_from_otp(sl_i2cspm_t *i2cspm, uint8_t otpAddr);

// Si7210 i2s address
#ifndef SI7210_I2C_BUS_ADDRESS
#define SI7210_I2C_BUS_ADDRESS  0x30
#endif

// Si7210 chip ID
#define SI7210_CHIP_ID          0x01

/**************************************************************************//**
 *    Does device-specific initializaiton for the Si7210 chip.
 *****************************************************************************/
sl_status_t sl_si7210_init(sl_i2cspm_t *i2cspm)
{
  sl_status_t status;
  uint8_t  chipId;
  uint8_t  revId;

  /* Wait 1 ms wake-up time */
  sl_sleeptimer_delay_millisecond(1);

  /* Try to contact the sensor and check it's device ID */
  status = sl_si7210_wake_up(i2cspm);
  if ( status != SL_STATUS_OK ) {
    return status;
  }

  status = sl_si7210_identify(i2cspm, &chipId, &revId);
  if ( status != SL_STATUS_OK ) {
    return status;
  }

  if ( (chipId != SI7210_CHIP_ID) ) {
    status = SL_STATUS_INITIALIZATION;
  }

  return status;
}

/**************************************************************************//**
 *    Configures the Si7210 chip.
 *****************************************************************************/
sl_status_t sl_si7210_configure(sl_i2cspm_t *i2cspm, sl_si7210_configure_t *config)
{
  sl_status_t status;
  uint8_t value;
  uint8_t sw_op, sw_hyst;

  /* Wake up device and/or stop measurements */
  status = sl_si7210_wake_up(i2cspm);
  if ( status != SL_STATUS_OK ) {
    return status;
  }

  /* Stop the measurement loop */
  status = sl_si7210_set_register_bits(i2cspm, SI7210_REG_ADDR_POWER_CTRL, SI7210_REG_POWER_CTRL_STOP_MASK);

  if ( status != SL_STATUS_OK ) {
    return status;
  }

  if ( (config->threshold == 0.0)
       && (config->hysteresis == 0.0)
       && (config->polarity == 0)
       && (config->output_invert == 0) ) {
    /* Use default values in the device for all parameters */
    status = sl_si7210_clear_register_bits(i2cspm, SI7210_REG_ADDR_POWER_CTRL,
                                           SI7210_REG_POWER_CTRL_USESTORE_MASK);

    if ( status != SL_STATUS_OK ) {
      return status;
    }
  } else {
    /* Program sw_low4field and sw_op bit fields */
    sw_op = sl_si7210_calculate_sw_op(config->threshold);

    value = 0;

    if ( config->output_invert ) {
      value = (1 << SI7210_REG_CTRL1_SW_LOW4FIELD_SHIFT) & SI7210_REG_CTRL1_SW_LOW4FIELD_MASK;
    }

    value |= (sw_op << SI7210_REG_CTRL1_SW_OP_SHIFT) & SI7210_REG_CTRL1_SW_OP_MASK;

    status = sl_si7210_write_register(i2cspm, SI7210_REG_ADDR_CTRL1, value);
    if ( status != SL_STATUS_OK ) {
      return status;
    }

    /* Program sw_fieldpolsel and sw_hyst bit fields */
    sw_hyst = sl_si7210_calculate_sw_hyst(config->hysteresis, false);

    value = (config->polarity << SI7210_REG_CTRL2_SW_FIELDPOLSEL_SHIFT) & SI7210_REG_CTRL2_SW_FIELDPOLSEL_MASK;

    value |= (sw_hyst << SI7210_REG_CTRL2_SW_HYST_SHIFT) & SI7210_REG_CTRL2_SW_HYST_MASK;

    status = sl_si7210_write_register(i2cspm, SI7210_REG_ADDR_CTRL2, value);
    if ( status != SL_STATUS_OK ) {
      return status;
    }

    /* Enable storing of these parameters in sleep mode */
    status = sl_si7210_set_register_bits(i2cspm, SI7210_REG_ADDR_POWER_CTRL,
                                         SI7210_REG_POWER_CTRL_USESTORE_MASK);

    if ( status != SL_STATUS_OK ) {
      return status;
    }
  }

  /* Enable sleep timer and clear stop bit to start operation */
  status = sl_si7210_set_register_bits(i2cspm, SI7210_REG_ADDR_CTRL3,
                                       SI7210_REG_CTRL3_SLTIMEENA_MASK);

  if ( status != SL_STATUS_OK ) {
    return status;
  }

  /* Resume operation  */
  status = sl_si7210_clear_register_bits(i2cspm, SI7210_REG_ADDR_POWER_CTRL,
                                         SI7210_REG_POWER_CTRL_STOP_MASK);

  return status;
}

/**************************************************************************//**
 *    Performs a measurement
 *****************************************************************************/
sl_status_t sl_si7210_measure(sl_i2cspm_t *i2cspm, uint32_t scale, float *result)
{
  int32_t mT;
  uint32_t status;
  bool range200mT;

  if ( scale > 20500 ) {
    range200mT = true;
  } else {
    range200mT = false;
  }

  status = sl_si7210_read_magfield_data_and_sltimeena(i2cspm, range200mT, &mT);

  *result = ((float) mT) / 1000;

