espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/hardware/driver/si7210/src/sl_si7210.c
  return status;
}

/**************************************************************************//**
 * @brief
 *    Returns the tamper level configured in the chip
 *
 * @return
 *    The tamper level in mT
 *****************************************************************************/
float sl_si7210_get_tamper_threshold(void)
{
  return 19.87f;
}

/**************************************************************************//**
 *    Read out Si7210 Conversion Data - 15bits
 *****************************************************************************/
sl_status_t sl_si7210_read_data(sl_i2cspm_t *i2cspm, int16_t *data)
{
  uint8_t read;
  uint8_t flag;
  sl_status_t status;

  status = sl_si7210_read_register(i2cspm, SI7210_REG_ADDR_DSPSIGM, &read);
  if (status != SL_STATUS_OK) {
    return status;
  }

  flag = read >> SI7210_REG_DSPSIGM_FRESH_SHIFT;
  *data = ((uint16_t)(read  & SI7210_REG_DSPSIGM_DSPSIGM_MASK)) << 8;
  status = sl_si7210_read_register(i2cspm, SI7210_REG_ADDR_DSPSIGL, &read);
  if (status != SL_STATUS_OK) {
    return status;
  }

  *data |= read;
  *data = *data - 16384;

  if ( flag == 0 ) {
    status = SL_STATUS_OBJECT_READ;
  }

  return status;
}

/**************************************************************************//**
 *    Puts Si7210 into Sleep (No-measurement) Mode
 *    Wake-up command needs to be issued to become responsive
 *****************************************************************************/
sl_status_t sl_si7210_sleep(sl_i2cspm_t *i2cspm)
{
  sl_status_t status;
  uint8_t read;

  status = sl_si7210_read_register(i2cspm, SI7210_REG_ADDR_CTRL3, &read);
  if (status != SL_STATUS_OK) {
    return status;
  }
  // Clear the sleep timer enable bit
  read = (read & ~SI7210_REG_CTRL3_SLTIMEENA_MASK);
  status = sl_si7210_write_register(i2cspm, SI7210_REG_ADDR_CTRL3, read);
  if (status != SL_STATUS_OK) {
    return status;
  }

  status = sl_si7210_read_register(i2cspm, SI7210_REG_ADDR_POWER_CTRL, &read);
  if (status != SL_STATUS_OK) {
    return status;
  }

  // Clear the oneburst and stop bits, set the sleep bit
  read = ((read & ~(SI7210_REG_POWER_CTRL_ONEBURST_MASK | SI7210_REG_POWER_CTRL_STOP_MASK)) | SI7210_REG_POWER_CTRL_SLEEP_MASK);
  status = sl_si7210_write_register(i2cspm, SI7210_REG_ADDR_POWER_CTRL, read);

  return status;
}
/**************************************************************************//**
 *    Puts Si7210 into Sleep w/ Measurement Mode: OUTPUT is updated 200msec
 *****************************************************************************/
sl_status_t sl_si7210_sleep_sltimeena(sl_i2cspm_t *i2cspm)
{
  uint8_t read;
  sl_status_t status;

  status = sl_si7210_read_register(i2cspm, SI7210_REG_ADDR_CTRL3, &read);
  if (status != SL_STATUS_OK) {
    return status;
  }

  // Set the sleep timer enable bit
  read = ((read & SI7210_REG_CTRL3_SW_TAMPER_MASK) | SI7210_REG_CTRL3_SLTIMEENA_MASK);
  status = sl_si7210_write_register(i2cspm, SI7210_REG_ADDR_CTRL3, read);
  if (status != SL_STATUS_OK) {
    return status;
  }

  status = sl_si7210_read_register(i2cspm, SI7210_REG_ADDR_POWER_CTRL, &read);
  if (status == SL_STATUS_OK) {
    return status;
  }

  // Clear the oneburst, stop and sleep bits
  read = (read & ~(SI7210_REG_POWER_CTRL_ONEBURST_MASK | SI7210_REG_POWER_CTRL_STOP_MASK | SI7210_REG_POWER_CTRL_SLEEP_MASK));
  status = sl_si7210_write_register(i2cspm, SI7210_REG_ADDR_POWER_CTRL, read);

  return status;
}

/**************************************************************************//**
 *    Read out Si7210 Revision and ID
 *****************************************************************************/
sl_status_t sl_si7210_identify(sl_i2cspm_t *i2cspm, uint8_t *id, uint8_t *rev)
{
  uint8_t read;
  sl_status_t status;

  status = sl_si7210_wake_up(i2cspm);
  if (status != SL_STATUS_OK) {
    return status;
  }

  status = sl_si7210_read_register(i2cspm, SI7210_REG_ADDR_HREVID, &read);
  if (status != SL_STATUS_OK) {
    return status;
  }

  *rev = read & SI7210_REG_HREVID_REVID_MASK;
  *id = read >> SI7210_REG_HREVID_CHIPID_SHIFT;
  status = sl_si7210_read_register(i2cspm, SI7210_REG_ADDR_POWER_CTRL, &read);
  if (status != SL_STATUS_OK) {
    return status;
  }

  // Clear the oneburst and sleep bits, set the stop bit
  read = ((read & ~(SI7210_REG_POWER_CTRL_ONEBURST_MASK | SI7210_REG_POWER_CTRL_SLEEP_MASK)) | SI7210_REG_POWER_CTRL_STOP_MASK);
  status = sl_si7210_write_register(i2cspm, SI7210_REG_ADDR_POWER_CTRL, read);

  return status;
}

/**************************************************************************//**
 *    Reads register from the OTP area of the Si7021 device
 *****************************************************************************/
sl_status_t sl_si7210_read_otp_register(sl_i2cspm_t *i2cspm, uint8_t otpAddr, uint8_t *otpData)
{
  sl_status_t status;
  uint8_t reg;

  status = sl_si7210_read_register(i2cspm, SI7210_REG_ADDR_OTP_CTRL, &reg);
  if ( status != SL_STATUS_OK ) {
    return status;
  }

  if ( reg & SI7210_REG_OTP_CTRL_BUSY_MASK ) {
    return SL_STATUS_BUSY;
  }

  status = sl_si7210_write_register(i2cspm, SI7210_REG_ADDR_OTP_ADDR, otpAddr);
  if ( status != SL_STATUS_OK ) {
    return status;
  }

  status = sl_si7210_write_register(i2cspm, SI7210_REG_ADDR_OTP_CTRL, SI7210_REG_OTP_CTRL_READ_EN_MASK);
  if ( status != SL_STATUS_OK ) {
    return status;
  }

  status = sl_si7210_read_register(i2cspm, SI7210_REG_ADDR_OTP_DATA, otpData);

  return status;
}

/**************************************************************************//**
 *    Change Mag-Field scale to 200mT.
 *    If desired, must be performed after power-up or wake-up from sleep.
 *****************************************************************************/
sl_status_t sl_si7210_set_mt_range_200(sl_i2cspm_t *i2cspm)
{
  sl_status_t status;
  status = sl_si7210_load_coefficients_from_otp(i2cspm, SI7210_OTP_ADDR_COEFFS_200MT);

  return status;
}

/**************************************************************************//**
 *   Perform burst-conversion(4samples), read mT-data, and then
 *   put part into sltimeena-sleep mode where OUT is updated every 200msec.
 *****************************************************************************/
sl_status_t sl_si7210_read_magfield_data_and_sltimeena(sl_i2cspm_t *i2cspm, bool range200mT, int32_t *mTdata)
{
  uint8_t read;
  int16_t data;
  sl_status_t status;

  status = sl_si7210_wake_up(i2cspm);
  if ( status != SL_STATUS_OK ) {
    return status;
  }

  status = sl_si7210_read_register(i2cspm, SI7210_REG_ADDR_POWER_CTRL, &read);
  if ( status != SL_STATUS_OK ) {
    return status;
  }

