espressif/esp-matter/connectedhomeip/connectedhomeip/third_party/openthread/ot-efr32/third_party/silabs/gecko_sdk/hardware/driver/si7210/src/sl_si7210.c
  // Clear oneburst and sleep bits, set Usestore and stop to stop measurements
  read = ((read & ~(SI7210_REG_POWER_CTRL_ONEBURST_MASK | SI7210_REG_POWER_CTRL_SLEEP_MASK)) | (SI7210_REG_POWER_CTRL_USESTORE_MASK | SI7210_REG_POWER_CTRL_STOP_MASK));
  status = sl_si7210_write_register(i2cspm, SI7210_REG_ADDR_POWER_CTRL, read);
  if ( status != SL_STATUS_OK ) {
    return status;
  }

  // Burst sample size = 4 (2^2), number of samples to average = 4 (2^2)
  status = sl_si7210_write_register(i2cspm, SI7210_REG_ADDR_CTRL4, ((2 << SI7210_REG_CTRL4_DF_BURSTSIZE_SHIFT) | (2 << SI7210_REG_CTRL4_DF_BW_SHIFT)));
  if ( status != SL_STATUS_OK ) {
    return status;
  }

  if ( range200mT ) {
    status = sl_si7210_set_mt_range_200(i2cspm);
    if ( status != SL_STATUS_OK ) {
      return status;
    }
  }
  // Clear stop and sleep bits, set Usestore and oneburst to start a burst of measurements
  status = sl_si7210_read_register(i2cspm, SI7210_REG_ADDR_POWER_CTRL, &read);
  if ( status != SL_STATUS_OK ) {
    return status;
  }

  read = ((read & ~(SI7210_REG_POWER_CTRL_STOP_MASK | SI7210_REG_POWER_CTRL_SLEEP_MASK)) | (SI7210_REG_POWER_CTRL_USESTORE_MASK | SI7210_REG_POWER_CTRL_ONEBURST_MASK));
  status = sl_si7210_write_register(i2cspm, SI7210_REG_ADDR_POWER_CTRL, read);
  if ( status != SL_STATUS_OK ) {
    return status;
  }

  // Wait until the measurement is done
  do {
    status = sl_si7210_read_register(i2cspm, SI7210_REG_ADDR_POWER_CTRL, &read);
  } while ( (read >> SI7210_REG_POWER_CTRL_MEAS_SHIFT) && (status == 0) );
  if ( status != SL_STATUS_OK ) {
    return status;
  }

  status = sl_si7210_read_data(i2cspm, &data);
  if ( status != SL_STATUS_OK ) {
    return status;
  }

  // To convert mTdata to decimal value, divide by 1000
  if ( range200mT ) {
    *mTdata = (data * 125 / 10);
  } else {
    *mTdata = (data * 125 / 100);
  }

  // Go to sleep with sleep timer enabled
  status = sl_si7210_sleep_sltimeena(i2cspm);

  return status;
}

/**************************************************************************//**
 *   Wake-up from Sleep, perform burst-conversion(4samples), read mT-data,
 *   and then put part into sleep mode (no-measurement). Requires Wake-Up.
 *****************************************************************************/
sl_status_t sl_si7210_read_magfield_data_and_sleep(sl_i2cspm_t *i2cspm, bool range200mT, int32_t *mTdata)
{
  uint8_t read;
  int16_t data;
  sl_status_t status;

  status = sl_si7210_wake_up(i2cspm);
  if ( status != SL_STATUS_OK ) {
    return status;
  }

  status = sl_si7210_read_register(i2cspm, SI7210_REG_ADDR_POWER_CTRL, &read);
  if ( status != SL_STATUS_OK ) {
    return status;
  }

  // Clear oneburst and sleep bits, set Usestore and stop to stop measurements
  read = ((read & ~(SI7210_REG_POWER_CTRL_ONEBURST_MASK | SI7210_REG_POWER_CTRL_SLEEP_MASK)) | (SI7210_REG_POWER_CTRL_USESTORE_MASK | SI7210_REG_POWER_CTRL_STOP_MASK));
  status = sl_si7210_write_register(i2cspm, SI7210_REG_ADDR_POWER_CTRL, read);
  if ( status != SL_STATUS_OK ) {
    return status;
  }

  // Burst sample size = 4 (2^2), number of samples to average = 4 (2^2)
  status = sl_si7210_write_register(i2cspm, SI7210_REG_ADDR_CTRL4, ((2 << SI7210_REG_CTRL4_DF_BURSTSIZE_SHIFT) | (2 << SI7210_REG_CTRL4_DF_BW_SHIFT)));
  if ( status != SL_STATUS_OK ) {
    return status;
  }

  if ( range200mT ) {
    status = sl_si7210_set_mt_range_200(i2cspm);
    if ( status != SL_STATUS_OK ) {
      return status;
    }
  }
  // Clear stop and sleep bits, set Usestore and oneburst to start a burst of measurements
  status = sl_si7210_read_register(i2cspm, SI7210_REG_ADDR_POWER_CTRL, &read);
  if ( status != SL_STATUS_OK ) {
    return status;
  }

  read = ((read & ~(SI7210_REG_POWER_CTRL_STOP_MASK | SI7210_REG_POWER_CTRL_SLEEP_MASK)) | (SI7210_REG_POWER_CTRL_USESTORE_MASK | SI7210_REG_POWER_CTRL_ONEBURST_MASK));
  status = sl_si7210_write_register(i2cspm, SI7210_REG_ADDR_POWER_CTRL, read);
  if ( status != SL_STATUS_OK ) {
    return status;
  }

  // Wait until the measurement is done
  do {
    status = sl_si7210_read_register(i2cspm, SI7210_REG_ADDR_POWER_CTRL, &read);
  } while ( (read >> SI7210_REG_POWER_CTRL_MEAS_SHIFT) && (status == 0) );
  if ( status != SL_STATUS_OK ) {
    return status;
  }

  status = sl_si7210_read_data(i2cspm, &data);
  if ( status != SL_STATUS_OK ) {
    return status;
  }

  // To convert mTdata to decimal value, divide by 1000
  if ( range200mT ) {
    *mTdata = (data * 125 / 10);
  } else {
    *mTdata = (data * 125 / 100);
  }

  // Go to sleep
  status = sl_si7210_sleep(i2cspm);

  return status;
}

/**************************************************************************//**
 *   Puts sensor into continuous mode, conversions performed every 7usec
 *****************************************************************************/
sl_status_t sl_si7210_enter_continuous_mode(sl_i2cspm_t *i2cspm)
{
  uint8_t read;
  sl_status_t status;

  status = sl_si7210_wake_up(i2cspm);
  status |= sl_si7210_read_register(i2cspm, SI7210_REG_ADDR_POWER_CTRL, &read);
  read = ((read & 0xF0) | 0x0A);
  status |= sl_si7210_write_register(i2cspm, SI7210_REG_ADDR_POWER_CTRL, read);
  status |= sl_si7210_write_register(i2cspm, SI7210_REG_ADDR_DSPSIGSEL, 4);
  status |= sl_si7210_write_register(i2cspm, SI7210_REG_ADDR_CTRL1, 0x7F);
  status |= sl_si7210_write_register(i2cspm, SI7210_REG_ADDR_CTRL2, 0x92);
  status |= sl_si7210_write_register(i2cspm, SI7210_REG_ADDR_SLTIME, 0x00);
  status |= sl_si7210_write_register(i2cspm, SI7210_REG_ADDR_CTRL3, 0xFE);
  status |= sl_si7210_read_register(i2cspm, SI7210_REG_ADDR_POWER_CTRL, &read);
  read = (read & 0xF8);
  status |= sl_si7210_write_register(i2cspm, SI7210_REG_ADDR_POWER_CTRL, read);

  return status;
}

/**************************************************************************//**
 *    Calculates the sw_op value from the threshold by finding the inverse of
 *    the formula:
 *    threshold = (16 + sw_op[3:0]) * 2^sw_op[6:4]
 *****************************************************************************/
uint8_t sl_si7210_calculate_sw_op(float threshold)
{
  int th;
  uint8_t a;
  uint8_t swop;

  th = (int) (threshold / 0.005);

  if ( th == 0 ) {
    /* threshold = 0, when swop = 127 */
    return 127;
  } else if ( th < 16 ) {
    threshold = 16;
  } else if ( threshold > 3840 ) {
    threshold = 3840;
  }

  a = th / 16;
  swop = 0;
  while ( a != 0x01 ) {
    a = a >> 1;   /* Find the most significant 1 of th */
    swop += 0x10;   /* increment sw_op[6:4] */
  }

  /* Add remainder as sw_op[3:0] */
  swop |= th / (1 << (swop >> 4)) - 16;

